docs/sp22m3345syllabus.org
:MACROS:
#+MACRO: quote @@html:<q>$1</q>@@@@latex:``$1''@@
#+MACRO: options (eval (progn (org-sbe "tk/options") (tk/options org-export-current-backend)))
#+MACRO: if-html (eval (if (org-export-derived-backend-p org-export-current-backend 'html) "$1"))
#+MACRO: hfill @@latex:\hfill$1@@@@html:<p style="text-align: right">$1</p>@@
:END:
:EXPORT_CONFIG:
# General ---------------------
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_FILE_NAME: sp22m3345syllabus

# LaTeX -----------------------
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{multirow}
#+LATEX_HEADER: \usepackage{setspace}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \hypersetup{colorlinks=true,linkcolor=blue,filecolor=blue,urlcolor=blue}
#+LATEX_HEADER: \pagestyle{plain}
#+LATEX_HEADER: \setlength\parindent{0pt}

# HTML ------------------------
#+HTML_HEAD_EXTRA:  <style type="text/css">
#+HTML_HEAD_EXTRA:    .noboldheader th {font-weight: normal;}
#+HTML_HEAD_EXTRA:    th.org-right  { text-align: right;  }
#+HTML_HEAD_EXTRA:    th.org-left   { text-align: left; }
#+HTML_HEAD_EXTRA:    th.org-center { text-align: center; }
#+HTML_HEAD_EXTRA:  </style>

# Theming ----------------
# Read the docs: set "toc:t"
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
# #+SETUPFILE: ../assets/org-themes/src/readtheorg_inline/readtheorg_inline.theme

# Comfy! Light Redish look
#+SETUPFILE: ../assets/org-themes/src/comfy_inline/comfy_inline.theme
# |--> Make H2 headings more distinguishable

# Clean, fun font
# #+SETUPFILE: ../assets/org-themes/src/imagine_light/imagine_light.theme
# |--> table alignment

# Professional and clean
# #+SETUPFILE: ../assets/org-themes/src/latexcss/latexcss.theme
# #+SETUPFILE: ../assets/org-themes/src/plain/plain.theme
# |-- the same as latexcss?
# #+SETUPFILE: ../assets/org-themes/src/simple_gray/simple_gray.theme
# |--> need to increase font size
# #+SETUPFILE: ../assets/org-themes/src/simple_inline/simple_inline.theme
# |--> horizontal alignments of tables
# #+SETUPFILE: ../assets/org-themes/src/simple_white/simple_white.theme
# |--> maybe change the background color of headings
# #+SETUPFILE: ../assets/org-themes/src/simple_whiteblue/simple_whiteblue.theme
# #+SETUPFILE: ../assets/org-themes/src/stylish_white/stylish_white.theme
# |--> font too thin
# #+SETUPFILE: ../assets/org-themes/src/white_clean/white_clean.theme
# |--> Using stars for headers (just like org mode)

# Meh (low readability, poor design, etc)
# #+SETUPFILE: ../assets/org-themes/src/bigblow_inline/bigblow_inline.theme
# #+SETUPFILE: ../assets/org-themes/src/darksun/darksun.theme
# #+SETUPFILE: ../assets/org-themes/src/rethink_inline/rethink_inline.theme
# #+SETUPFILE: ../assets/org-themes/src/retro_dark/retro_dark.theme

# Solarized: not a big fan of the theme, but like the bold sizing of headers
# #+SETUPFILE: ../assets/org-themes/src/solarized_dark/solarized_dark.theme
# #+SETUPFILE: ../assets/org-themes/src/solarized_light/solarized_light.theme
:END:
#+STARTUP: indent overview
#+OPTIONS: date:nil author:nil title:nil timestamp:t
{{{options}}}
#+TITLE: SP22M3345 Syllabus
#+AUTHOR: Tae Eun Kim, Ph.D.

* Utility codes                                                    :noexport:

Nice way to load options conditionally based on [[https://emacs.stackexchange.com/questions/64029/can-org-options-be-applied-to-specific-export-modes-only][this post]]. See the macro =options= defined at the top of this document.

#+name: tk/options
#+begin_src elisp
  (defun tk/options (backend)
     "Different options for different backends. Caveat: this function needs to be
      defined, before the file is exported. And if e.g. an option changes, it needs to
      be defined again (just run the code block with `C-c C-c')."
     (cond
      ((org-export-derived-backend-p backend 'latex) "#+OPTIONS: latex:t num:nil toc:nil")
      ((org-export-derived-backend-p backend 'html) "#+OPTIONS: html:t num:nil toc:nil")))
#+end_src

* Notes                                                            :noexport:
 - https://people.math.osu.edu/nguyen.1261/3345-19.html
 - https://people.math.osu.edu/paquette.30/Teaching/Math3345Syllabus.pdf
 - https://people.math.osu.edu/fusi.1/Math-3345-Syllabus.pdf

* Title                                                              :ignore:
** LaTeX                                                            :ignore:
#+BEGIN_EXPORT latex
\textit{\footnotesize Updated on \today}

\hrulefill
\vspace{1em}
\begin{center}
  \begin{tabular}{ c }
    \Large \bf Math 3345 -- Spring 2022 \\\\
    \LARGE \bf Foundations of Higher Mathematics
    % \large \sf (Distance Learning)
  \end{tabular}
\end{center}
\vspace{5mm}
\hfill
\begin{tabular}{rl}
  \large Lecturer: & Tae Eun Kim, Ph.D.\\
  \large Email: & \url{kim.3562@osu.edu} \\
  \large Office: & Math Tower 349 \\
  \large Office Hours: & MW 4:30PM -- 6:00PM
\end{tabular}
\vspace{5mm}
#+END_EXPORT

** HTML                                                             :ignore:

#+begin_comment
For now, hard-coded the following table in html. Figure out a way to export it conditionally.
#+ATTR_HTML: :class org-right noboldheader

| <l>          |                <r> |
| Lecturer     | Tae Eun Kim, Ph.D. |
| Email        |   [[mailto:kim.3562@osu.edu][kim.3562@osu.edu]] |
| Office       |     Math Tower 349 |
| Office Hours | MW 4:30PM --6:00PM |
#+end_comment

#+begin_export html
<h1 style="text-align:center; margin:.8em auto; color:#666666">Spring 2022: Math 3345</h1>
<h1 style="text-align:center; margin: 1em auto; font-size:x-large; color:#666666">Foundations of Higher Mathematics</h1>

<br>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="org-right noboldheader">

  <colgroup>
    <col  class="org-left" />
    <col  class="org-right" />
  </colgroup>

  <tbody>
    <tr>
      <td class="org-left">Lecturer</td>
      <td class="org-right">Tae Eun Kim, Ph.D.</td>
    </tr>

    <tr>
      <td class="org-left">Email</td>
      <td class="org-right"><a href="mailto:kim.3562@osu.edu">kim.3562@osu.edu</a></td>
    </tr>

    <tr>
      <td class="org-left">Office</td>
      <td class="org-right">Math Tower 349</td>
    </tr>

    <tr>
      <td class="org-left">Office Hours</td>
      <td class="org-right">MW 4:30PM &#x2013;6:00PM</td>
    </tr>
  </tbody>
</table>
#+end_export

* Course Objectives
#+LATEX: \begingroup\it
#+ATTR_HTML: :style font-style:italic
#+BEGIN_QUOTE
Introduction to logic, proof techniques, st theory, number theory, real numbers.
#+END_QUOTE
#+LATEX: \endgroup

#+LATEX: \hfill
#+ATTR_HTML: :style text-align: right
-- [[https://math.osu.edu/sites/sites/default/files/courses/3345_0.pdf][Math Department Course Description]]

* Prerequisites                                                    :noexport:

Major or minor in Math, CSE, or CIS.

 - *Math:* C- or better in 2153, 2162.xx, 2173, or 2182H
 - *CIS or CSE:* C- or better in both CSE 2321 and C- or better in 1151, 1161.xx, 1172, 1181H, 1534, or 1544

* Texts

 - /The Fundamentals of Higher Mathematics/ (Spring 2022 edition), by N. Falkner.

Copies of the textbook are being produced by a company called XanEdu. They will be available through the OSU branch of Barnes & Noble, in a DRM-protected digital form. Go to [[https://ohiostate.bncollege.com][ohiostate.bncollege.com]] and follow the obvious links and prompts.

In addition, all lecture slides and notes will be provided.

* Technology Requirements                                          :noexport:

 - *General Computing Environment.* You are required to have an access to a computer with a stable internet connection as major aspects of the course will be conducted online. Homework, online quizzes, and exams will be turned in via Carmen or Gradescope. You are responsible for maintaining your web browser and internet connection compatible with these course tools.

 - *Handwritten Work to PDF.* You are required to have some means to convert your handwritten work into a .pdf file in order to prepare some of your assignments for online submission. This can be done, for example, using a note-taking app on a tablet device or scanning your work using a cell-phone scanner app.

 - *MATLAB.* As MATLAB is an integral part of this course, you will need access to it both during and outside of virtual classes. You may download a copy of the software by following the instructions at [[http://ocio.osu.edu/software/]]. You are responsible for backing up your work regularly using a reliable method of your choice.

* Course Grade

Your grade will be based on your performance on the following assignments:

#+ATTR_HTML: :class org-center noboldheader
#+ATTR_LATEX: :center t :align l|r
| /            |   <> |
| <l>          |  <r> |
| Quizzes      |   5% |
| Homework     |  20% |
| Midterms (2) |  40% |
| Final Exam   |  35% |
|--------------+------|
| Total        | 100% |

*** Quizzes (5%)
Quizzes are taken as timed quizzes on Carmen.

Details are to be provided soon.

*** Homework (20%)
The homework problems will be assigned along the semester. Assignments will be collected and graded electronically using Gradescope.

Further details are to be provided soon.

