docs/sp22m3345syllabus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-09 Sun 18:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SP22M3345 Syllabus</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">


<h1 style="text-align:center; margin:.8em auto; color:#666666">Spring 2022: Math 3345</h1>
<h1 style="text-align:center; margin: 1em auto; font-size:x-large; color:#666666">Foundations of Higher Mathematics</h1>

<br>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="org-right noboldheader">

  <colgroup>
    <col  class="org-left" />
    <col  class="org-right" />
  </colgroup>

  <tbody>
    <tr>
      <td class="org-left">Lecturer</td>
      <td class="org-right">Tae Eun Kim, Ph.D.</td>
    </tr>

    <tr>
      <td class="org-left">Email</td>
      <td class="org-right"><a href="mailto:kim.3562@osu.edu">kim.3562@osu.edu</a></td>
    </tr>

    <tr>
      <td class="org-left">Office</td>
      <td class="org-right">Math Tower 349</td>
    </tr>

    <tr>
      <td class="org-left">Office Hours</td>
      <td class="org-right">MW 4:30PM &#x2013;6:00PM</td>
    </tr>
  </tbody>
</table>

<div id="outline-container-org1336a5a" class="outline-2">
<h2 id="org1336a5a">Course Objectives</h2>
<div class="outline-text-2" id="text-org1336a5a">
<blockquote style="font-style:italic">
<p>
Introduction to logic, proof techniques, st theory, number theory, real numbers.
</p>
</blockquote>
<p style="text-align: right">
&#x2013; <a href="https://math.osu.edu/sites/sites/default/files/courses/3345_0.pdf" style="text-align: right">Math Department Course Description</a>
</p>
</div>
</div>

<div id="outline-container-org4ae22a2" class="outline-2">
<h2 id="org4ae22a2">Texts</h2>
<div class="outline-text-2" id="text-org4ae22a2">
<ul class="org-ul">
<li><i>The Fundamentals of Higher Mathematics</i> (Spring 2022 edition), by N. Falkner.</li>
</ul>

<p>
Copies of the textbook are being produced by a company called XanEdu. They will be available through the OSU branch of Barnes &amp; Noble, in a DRM-protected digital form. Go to <a href="https://ohiostate.bncollege.com">ohiostate.bncollege.com</a> and follow the obvious links and prompts.
</p>

<p>
In addition, all lecture slides and notes will be provided.
</p>
</div>
</div>

<div id="outline-container-orgb6d18fa" class="outline-2">
<h2 id="orgb6d18fa">Course Grade</h2>
<div class="outline-text-2" id="text-orgb6d18fa">
<p>
Your grade will be based on your performance on the following assignments:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="org-center noboldheader">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Quizzes</th>
<th scope="col" class="org-right">5%</th>
</tr>

<tr>
<th scope="col" class="org-left">Homework</th>
<th scope="col" class="org-right">20%</th>
</tr>

<tr>
<th scope="col" class="org-left">Midterms (2)</th>
<th scope="col" class="org-right">40%</th>
</tr>

<tr>
<th scope="col" class="org-left">Final Exam</th>
<th scope="col" class="org-right">35%</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Total</td>
<td class="org-right">100%</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org3a58f9a" class="outline-4">
<h4 id="org3a58f9a">Quizzes (5%)</h4>
<div class="outline-text-4" id="text-org3a58f9a">
<p>
Quizzes are taken as timed quizzes on Carmen.
</p>

<p>
Details are to be provided soon.
</p>
</div>
</div>

<div id="outline-container-orgc951752" class="outline-4">
<h4 id="orgc951752">Homework (20%)</h4>
<div class="outline-text-4" id="text-orgc951752">
<p>
The homework problems will be assigned along the semester. Assignments will be collected and graded electronically using Gradescope.
</p>

<p>
Further details are to be provided soon.
</p>
</div>
</div>
