docs/sp22m3345syllabus.org
*** Exams (75%)
There will be *3 exams* throughout the semester, the last of which is the final exam. The dates and weights of the exams are shown in the table below.

#+ATTR_HTML: :class org-center noboldheader
#+ATTR_LATEX: :center t
| /                | <                                                      |
| <l>              | <l>                                                    |
| Midterm 1 (20%)  | TBD                                                    |
| Midterm 2 (20%)  | TBD                                                    |
| Final Exam (30%) | 10:00AM -- 11:45AM, Thursday, April 28 (Section 22786) |
|                  | 12:00PM -- 1:45PM, Friday, April 29 (Section 21138)    |

Further details on exams or exam-specific policies will be released closer to the exam dates.

Some aspects and details about the administration of exams are yet to be determined. They will be announced both in class and on Carmen no later than a week prior to the first exam.

The final exam schedules are based on the guidelines of the University Registrar: [[https://registrar.osu.edu/scheduling/SchedulingContent/SP22Finals.pdf][Spring 22 Final Exam Schedule]].

* Grading Scale

The course letter grades will be determined using the OSU standard grading scheme:

#+ATTR_HTML: :class org-center noboldheader
#+ATTR_LATEX: :center t
| /   | <         |
| <l> | <l>       |
| A   | [93, 100] |
| A-  | [90, 93)  |
| B+  | [87, 90)  |
| B   | [83, 87)  |
| B-  | [80, 83)  |
| C+  | [77, 80)  |
| C   | [73, 77)  |
| C-  | [70, 73)  |
| D+  | [67, 70)  |
| D   | [60, 67)  |
| E   | [0, 60)   |

These grading cutoffs will never be raised, but could be adjusted at the end of the semester. Individual assignments, including exams, *will not be curved*; _no email inquiries about this matter will be answered._

* E-mail Communication

I will only respond to class-related emails sent from your _university email account_. In addition, please keep in mind the following:

 - Send your email to [[mailto:kim.3562@osu.edu][kim.3562@osu.edu]], not =kim.3562@buckeyemail.osu.edu=. It is absolutely important that you remember this because the account ending ="buckeyemail.osu.edu"= account is unattended.
 - In the subject line of your email, include the course number (Math 3345) so that I know to respond in an appropriate time frame.
 - Do not send attachments without first discussing it with me. It is sufficient to send the attachment in a separate email after describing it in a prior email.

* Plagiarism                                                       :noexport:

Plagiarism will not be tolerated, especially when it comes to code. Do not copy your code from other students, online sources, or anyone else, and do not give your code to anyone else to copy.  You may however discuss problems with other students and render help in debugging.

@@latex:\bgroup \small@@
*Exceptions:* you are permitted to use code from the textbook or presented during class, but you must still be able to explain how it is supposed to work.
@@latex:\egroup@@

* Academic Misconduct Statement

It is the responsibility of the Committee on Academic Misconduct to investigate or establish procedures for the investigation of all reported cases of student academic misconduct. The term “academic misconduct” includes all forms of student academic misconduct wherever committed; illustrated by, but not limited to, cases of plagiarism and dishonest practices in connection with examinations. Instructors shall report all instances of alleged academic misconduct to the committee (Faculty Rule 3335-5-48.7). For additional information, see the Code of Student Conduct at [[https://studentlife.osu.edu/csc/]].

* Ownership of Course Recordings

Ownership of course recordings and other materials (including exams and problem sets) and associated distribution rights shall be governed by the University Intellectual Property Policy for instructional works created by faculty or staff. Distribution of these works outside the context of the course may only be done with the express written permission of the relevant course instructor, and must comply with federal, state, and OSU student privacy rule and guidelines, including OSU Carmen terms of use.

* Health and Safety Concerns

All students, faculty and staff are required to comply with and stay up to date on all university safety and health guidance (https://safeandhealthy.osu.edu), which includes following university mask policies and maintaining a safe physical distance at all times. Non-compliance will be warned first and disciplinary actions will be taken for repeated offenses.

* Contingency for Change of Instructors

If an instructor is unable to continue work in the course for any reason, instruction work will shift to a substitute instructor.  Instructors in need of a substitute will not be expected to deal with any aspect of the transition to a substitute.  Direct communication with instructors over OSU email will not be accessible by substitutes, while communication via Carmen messaging should be immediately accessible to substitutes.

* Mental Health Statement

As a student you may experience a range of issues that can cause barriers to learning, such as strained relationships, increased anxiety, alcohol/drug problems, feeling down, difficulty concentrating and/or lack of motivation. These mental health concerns or stressful events may lead to diminished academic performance or reduce a student’s ability to participate in daily activities. The Ohio State University offers services to assist you with addressing these and other concerns you may be experiencing. If you or someone you know are suffering from any of the aforementioned conditions, you can learn more about the broad range of confidential mental health services available on campus via the Office of Student Life’s Counseling and Consultation Service (CCS) by visiting [[https://ccs.osu.edu]] or calling 614-292-5766. CCS is located on the 4th Floor of the Younkin Success Center and 10th Floor of Lincoln Tower. You can reach an on call counselor when CCS is closed at 614-292-5766 and 24 hour emergency help is also available through the 24/7 National Suicide Prevention Hotline at 1-800-273-TALK or at [[https://suicidepreventionlifeline.org]].

* Sexual Misconduct Statement

Title IX makes it clear that violence and harassment based on sex and gender are Civil Rights offenses subject to the same kinds of accountability and the same kinds of support applied to offenses against other protected categories (/e.g./, race). If you or someone you know has been sexually harassed or assaulted, you may find the appropriate resources at [[https://titleix.osu.edu]] or by contacting the Ohio State Title IX Coordinator, Kellie Brennan, at [[mailto:titleix@osu.edu][titleix@osu.edu]].

