docs/sp22m3345syllabus.html

<div id="outline-container-org752b6e8" class="outline-4">
<h4 id="org752b6e8">Exams (75%)</h4>
<div class="outline-text-4" id="text-org752b6e8">
<p>
There will be <b>3 exams</b> throughout the semester, the last of which is the final exam. The dates and weights of the exams are shown in the table below.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="org-center noboldheader">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Midterm 1 (20%)</td>
<td class="org-left">TBD</td>
</tr>

<tr>
<td class="org-left">Midterm 2 (20%)</td>
<td class="org-left">TBD</td>
</tr>

<tr>
<td class="org-left">Final Exam (30%)</td>
<td class="org-left">10:00AM &#x2013; 11:45AM, Thursday, April 28 (Section 22786)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">12:00PM &#x2013; 1:45PM, Friday, April 29 (Section 21138)</td>
</tr>
</tbody>
</table>

<p>
Further details on exams or exam-specific policies will be released closer to the exam dates.
</p>

<p>
Some aspects and details about the administration of exams are yet to be determined. They will be announced both in class and on Carmen no later than a week prior to the first exam.
</p>

<p>
The final exam schedules are based on the guidelines of the University Registrar: <a href="https://registrar.osu.edu/scheduling/SchedulingContent/SP22Finals.pdf">Spring 22 Final Exam Schedule</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc0e939c" class="outline-2">
<h2 id="orgc0e939c">Grading Scale</h2>
<div class="outline-text-2" id="text-orgc0e939c">
<p>
The course letter grades will be determined using the OSU standard grading scheme:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="org-center noboldheader">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">[93, 100]</td>
</tr>

<tr>
<td class="org-left">A-</td>
<td class="org-left">[90, 93)</td>
</tr>

<tr>
<td class="org-left">B+</td>
<td class="org-left">[87, 90)</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">[83, 87)</td>
</tr>

<tr>
<td class="org-left">B-</td>
<td class="org-left">[80, 83)</td>
</tr>

<tr>
<td class="org-left">C+</td>
<td class="org-left">[77, 80)</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">[73, 77)</td>
</tr>

<tr>
<td class="org-left">C-</td>
<td class="org-left">[70, 73)</td>
</tr>

<tr>
<td class="org-left">D+</td>
<td class="org-left">[67, 70)</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">[60, 67)</td>
</tr>

<tr>
<td class="org-left">E</td>
<td class="org-left">[0, 60)</td>
</tr>
</tbody>
</table>

<p>
These grading cutoffs will never be raised, but could be adjusted at the end of the semester. Individual assignments, including exams, <b>will not be curved</b>; <span class="underline">no email inquiries about this matter will be answered.</span>
</p>
</div>
</div>

<div id="outline-container-org8f2a1de" class="outline-2">
<h2 id="org8f2a1de">E-mail Communication</h2>
<div class="outline-text-2" id="text-org8f2a1de">
<p>
I will only respond to class-related emails sent from your <span class="underline">university email account</span>. In addition, please keep in mind the following:
</p>

<ul class="org-ul">
<li>Send your email to <a href="mailto:kim.3562@osu.edu">kim.3562@osu.edu</a>, not <code>kim.3562@buckeyemail.osu.edu</code>. It is absolutely important that you remember this because the account ending <code>"buckeyemail.osu.edu"</code> account is unattended.</li>
<li>In the subject line of your email, include the course number (Math 3345) so that I know to respond in an appropriate time frame.</li>
<li>Do not send attachments without first discussing it with me. It is sufficient to send the attachment in a separate email after describing it in a prior email.</li>
</ul>
</div>
</div>

<div id="outline-container-org8baa509" class="outline-2">
<h2 id="org8baa509">Academic Misconduct Statement</h2>
<div class="outline-text-2" id="text-org8baa509">
<p>
It is the responsibility of the Committee on Academic Misconduct to investigate or establish procedures for the investigation of all reported cases of student academic misconduct. The term “academic misconduct” includes all forms of student academic misconduct wherever committed; illustrated by, but not limited to, cases of plagiarism and dishonest practices in connection with examinations. Instructors shall report all instances of alleged academic misconduct to the committee (Faculty Rule 3335-5-48.7). For additional information, see the Code of Student Conduct at <a href="https://studentlife.osu.edu/csc/">https://studentlife.osu.edu/csc/</a>.
</p>
</div>
</div>

<div id="outline-container-orgd7c3620" class="outline-2">
<h2 id="orgd7c3620">Ownership of Course Recordings</h2>
<div class="outline-text-2" id="text-orgd7c3620">
<p>
Ownership of course recordings and other materials (including exams and problem sets) and associated distribution rights shall be governed by the University Intellectual Property Policy for instructional works created by faculty or staff. Distribution of these works outside the context of the course may only be done with the express written permission of the relevant course instructor, and must comply with federal, state, and OSU student privacy rule and guidelines, including OSU Carmen terms of use.
</p>
</div>
</div>

<div id="outline-container-org4c9b3ca" class="outline-2">
<h2 id="org4c9b3ca">Health and Safety Concerns</h2>
<div class="outline-text-2" id="text-org4c9b3ca">
<p>
All students, faculty and staff are required to comply with and stay up to date on all university safety and health guidance (<a href="https://safeandhealthy.osu.edu">https://safeandhealthy.osu.edu</a>), which includes following university mask policies and maintaining a safe physical distance at all times. Non-compliance will be warned first and disciplinary actions will be taken for repeated offenses.
</p>
</div>
</div>

<div id="outline-container-orgeeba4cd" class="outline-2">
<h2 id="orgeeba4cd">Contingency for Change of Instructors</h2>
<div class="outline-text-2" id="text-orgeeba4cd">
<p>
If an instructor is unable to continue work in the course for any reason, instruction work will shift to a substitute instructor.  Instructors in need of a substitute will not be expected to deal with any aspect of the transition to a substitute.  Direct communication with instructors over OSU email will not be accessible by substitutes, while communication via Carmen messaging should be immediately accessible to substitutes.
</p>
</div>
</div>

<div id="outline-container-org912efe4" class="outline-2">
<h2 id="org912efe4">Mental Health Statement</h2>
<div class="outline-text-2" id="text-org912efe4">
<p>
As a student you may experience a range of issues that can cause barriers to learning, such as strained relationships, increased anxiety, alcohol/drug problems, feeling down, difficulty concentrating and/or lack of motivation. These mental health concerns or stressful events may lead to diminished academic performance or reduce a student’s ability to participate in daily activities. The Ohio State University offers services to assist you with addressing these and other concerns you may be experiencing. If you or someone you know are suffering from any of the aforementioned conditions, you can learn more about the broad range of confidential mental health services available on campus via the Office of Student Life’s Counseling and Consultation Service (CCS) by visiting <a href="https://ccs.osu.edu">https://ccs.osu.edu</a> or calling 614-292-5766. CCS is located on the 4th Floor of the Younkin Success Center and 10th Floor of Lincoln Tower. You can reach an on call counselor when CCS is closed at 614-292-5766 and 24 hour emergency help is also available through the 24/7 National Suicide Prevention Hotline at 1-800-273-TALK or at <a href="https://suicidepreventionlifeline.org">https://suicidepreventionlifeline.org</a>.
</p>
</div>
</div>

<div id="outline-container-org6685ccd" class="outline-2">
<h2 id="org6685ccd">Sexual Misconduct Statement</h2>
<div class="outline-text-2" id="text-org6685ccd">
<p>
Title IX makes it clear that violence and harassment based on sex and gender are Civil Rights offenses subject to the same kinds of accountability and the same kinds of support applied to offenses against other protected categories (<i>e.g.</i>, race). If you or someone you know has been sexually harassed or assaulted, you may find the appropriate resources at <a href="https://titleix.osu.edu">https://titleix.osu.edu</a> or by contacting the Ohio State Title IX Coordinator, Kellie Brennan, at <a href="mailto:titleix@osu.edu">titleix@osu.edu</a>.
</p>
</div>
</div>
