docs/sp22m3345syllabus.org
* Diversity Statement

The Ohio State University affirms the importance and value of diversity in the student body. Our programs and curricula reflect our multicultural society and global economy and seek to provide opportunities for students to learn more about persons who are different from them. We are committed to maintaining a community that recognizes and values the inherent worth and dignity of every person; fosters sensitivity, understanding, and mutual respect among each member of our community; and encourages each individual to strive to reach his or her own potential. Discrimination against any individual based upon protected status, which is defined as age, color, disability, gender identity or expression, national origin, race, religion, sex, sexual orientation, or veteran status, is prohibited.

* Disability Services Statement

#+LATEX: \begin{spacing}{1.5}
#+LATEX: \bgroup\Large\sf
#+ATTR_HTML: :style font-size: 1.44em; line-height: 1.5
#+BEGIN_QUOTE
The university strives to make all learning experiences as accessible as possible. In light of the current pandemic, students seeking to request COVID-related accommodations may do so through the university’s request process, managed by Student Life Disability Services.  If you anticipate or experience academic barriers based on your disability (including mental health, chronic, or temporary medical conditions), please let me know immediately so that we can privately discuss options.  To establish reasonable accommodations, I may request that you register with Student Life Disability Services.  After registration, make arrangements with me as soon as possible to discuss your accommodations so that they may be implemented in a timely fashion. SLDS contact information: [[mailto:slds@osu.edu][slds@osu.edu]]; 614-292-3307; [[https://slds.osu.edu]]; 098 Baker Hall, 113 W. 12th Avenue.
#+END_QUOTE
#+LATEX: \egroup
#+LATEX: \end{spacing}
